In [1]:
# 쥬피터 노트북 셀 크기 설정 
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; font-weight:bold }</style>"))

# 경고메세지 숨기기
import warnings
warnings.filterwarnings(action='ignore')

C:\Users\pusan\AppData\Local\Temp\ipykernel_8636\2634226238.py:2: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython display
  from IPython.core.display import display, HTML

In [2]:
import pandas as pd
import numpy as np

### 특정값의 수 - value_counts()

- 카테고리컬 데이타, 이산형 데이타일때 사용
- 특정값의 갯수
- 데이타프레임[컬럼].value_counts()

In [17]:
df = pd.read_csv("data/wages.csv")
df.sample(3)

             earn  height     sex   race  ed  age
261  32796.950872   63.87  female  black  13   43
949  30161.929346   72.16    male  white  12   32
80     991.599966   64.79  female  white  13   67

In [18]:
# 카테고리컬 데이타 찾기
df['sex'].unique(), df['race'].unique()

(array(['male', 'female'], dtype=object),
 array(['white', 'other', 'hispanic', 'black'], dtype=object))

In [19]:
# 연속형 테이타 찾기
df['age'].unique(), df['earn'].unique()

(array([49, 62, 33, 95, 43, 30, 53, 50, 25, 69, 54, 38, 31, 55, 39, 48, 59,
        26, 45, 64, 42, 37, 23, 29, 35, 82, 61, 34, 36, 22, 60, 32, 67, 47,
        72, 56, 57, 51, 71, 65, 40, 27, 63, 24, 77, 93, 83, 70, 41, 44, 28,
        46, 66, 75, 73, 52, 68, 78, 81, 58, 86, 80, 79, 85, 76, 88, 87, 89,
        92, 91, 74, 84, 90], dtype=int64),
 array([79571.29901102, 96396.98864331, 48710.66694739, ...,
        13710.67131164, 95426.01441029,  9575.46185684]))

In [21]:
# value_counts() 적용
# 남녀별 데이타 갯수
print(df['sex'].unique())
df['sex'].value_counts()

['male' 'female']

female    859
male      520
Name: sex, dtype: int64

In [22]:
# NaN을 제외한 실제 값이 몇개인가?
df['sex'].count()

1379

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [24]:
df[df['sex'] == 'female']

               earn  height     sex      race  ed  age
1      96396.988643   66.23  female     white  16   62
2      48710.666947   63.77  female     white  16   33
3      80478.096153   63.22  female     other  16   95
4      82089.345498   63.08  female     white  17   43
5      15313.352901   64.53  female     white  15   30
...             ...     ...     ...       ...  ..  ...
1368    4184.222685   60.19  female  hispanic   6   71
1370  175901.453598   65.90  female     other  18   52
1373   16905.557851   70.08  female     white  16   40
1375   24853.519514   61.31  female     white  18   86
1376   13710.671312   63.64  female     white  12   37

[859 rows x 6 columns]

In [26]:
# race의 각각의 값 분포
df['race'].value_counts()

white       1147
black        126
hispanic      77
other         29
Name: race, dtype: int64

In [33]:
 # 나이 age값의 분포
df['age'].value_counts()

36    45
32    43
33    42
34    41
43    40
      ..
83     1
89     1
88     1
93     1
90     1
Name: age, Length: 73, dtype: int64

In [32]:
# 1~10위까지 나이의 분포
df['age'].value_counts()[:10]

36    45
32    43
33    42
34    41
43    40
30    40
35    39
37    39
38    38
45    38
Name: age, dtype: int64

In [34]:
df['earn'].value_counts()

79571.299011    1
23809.447738    1
45529.938971    1
33388.298766    1
8012.349072     1
               ..
13735.407524    1
19065.517947    1
13712.766222    1
71637.552888    1
9575.461857     1
Name: earn, Length: 1379, dtype: int64

### cut(), qcut()
- 연속 수치형 변수를 동일한 구간으로 나눈 범주형 레이블로 변경
- pd.cut(데이타프레임[컬럼명], 구간의 갯수, labels = 라벨리스트)
    - 동일한 갯수로 구간을 나누는 함수
- pd.qcut(데이타프레임[컬럼명], 구간의 갯수, labels = 라벨리스트)
- 예시) 1~100 세  구간 나누기 
```
 1~10 => age1
 11~20 => age2
 ...
 91~100 => age10
```

In [37]:
# age 컬럼의 최대값과 최소값 확인
df['age'].max(), df['age'].min()
# df['age'].value_counts()

(95, 22)

In [38]:
# age 컬럼의 최대값과 최소값 확인
df['age'].value_counts()

36    45
32    43
33    42
34    41
43    40
      ..
83     1
89     1
88     1
93     1
90     1
Name: age, Length: 73, dtype: int64

In [69]:
# age 컬럼의 3개의 구간으로 분리
# pd.cut(데이타프레임[컬럼명], 구간의 갯수, labels = 라벨리스트)
df['age_class'] = pd.cut(df['age'], 3, labels = ['young', 'adult', 'old'])

In [70]:
df.sample(3)

              earn  height     sex   race  ed  age age_class
303   16889.515855   65.01  female  white  14   71       old
424     988.758787   65.93  female  white  10   42     young
1316  82711.753363   60.14    male  white  15   54     adult

In [71]:
df['age_class'].value_counts()

young    834
adult    430
old      115
Name: age_class, dtype: int64

In [72]:
# age 컬럼의 3개의 구간으로 분리
# pd.qcut(데이타프레임[컬럼명], 구간의 갯수, labels = 라벨리스트)
df['age_class2'] = pd.qcut(df['age'], 3, labels = ['young2', 'adult2', 'old2'])

In [78]:
df.sample(3)

              earn  height     sex   race  ed  age age_class age_class2
543   35983.455717   59.68  female  white  12   45     young     adult2
1092  36593.693242   64.16    male  white  13   36     young     young2
1145   5771.771149   68.35  female  white  12   27     young     young2

In [79]:
df['age_class2'].value_counts()

young2    487
adult2    456
old2      436
Name: age_class2, dtype: int64

In [92]:
# cut() 함수의 데이타 확인
print(df[df['age_class'] == 'young']['age'].min(),df[df['age_class'] == 'young']['age'].max())
print(df[df['age_class'] == 'adult']['age'].min(),df[df['age_class'] == 'adult']['age'].max())
print(df[df['age_class'] == 'old']['age'].min(),df[df['age_class'] == 'old']['age'].max())

22 46
47 70
71 95

In [93]:
# qcut() 함수의 데이타 확인
print(df[df['age_class2'] == 'young2']['age'].min(),df[df['age_class2'] == 'young2']['age'].max())
print(df[df['age_class2'] == 'adult2']['age'].min(),df[df['age_class2'] == 'adult2']['age'].max())
print(df[df['age_class2'] == 'old2']['age'].min(),df[df['age_class2'] == 'old2']['age'].max())

22 36
37 50
51 95

### Python의 lambda
- 익명함수
- 한즐함수
- lambda 입력변수:출력문

In [94]:
# 일반함수 - 두수의 합
def f1(x,y):
    return x+y
f1(100,200)

300

In [96]:
# 람다함수 - 두 수의 합
# lambda 입력변수:출력문
f2 = lambda x,y:x+y
f2(100,200)

300

In [97]:
(lambda x, y:x+y)(100,200)

300

### Pandas : lambda + map
- 데이타프레임 컬럼(즉 시리즈) 값에 함수를 적용할 때 사용
- 데이타프레임.컬럼.map(람다함수|함수명)
- 데이타프레임[컬럼].map(람다함수|함수명)
- 데이타프레임.컬럼.map({ 기존값:새로운값} )

In [98]:
# 시리즈 + map()
s = pd.Series(np.arange(1,11))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [100]:
# 숫자 => 숫자 번 (10 => 10번)
# 람다함수로 구현
(lambda x:str(x)+'번')(100)

'100번'

In [103]:
# 시리즈에 적용
s.map(lambda x:str(x)+'번')

0     1번
1     2번
2     3번
3     4번
4     5번
5     6번
6     7번
7     8번
8     9번
9    10번
dtype: object

### 데이타프레임과 map()

In [125]:
df = pd.read_csv('data/wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [148]:
# earn 컬럼의 갑 앞에 모두 $ 삽입
(lambda x:'$ ' + str(x))(79571.299011)

'$ 79571.299011'

In [149]:
# 데이타프레임.컬럼.map(람다함수|함수명)
# 데이타프레임[컬럼].map(람다함수|함수명)
df['earn'].map(lambda x:'$ ' + str(x))

0        $ 79571.299011024
1       $ 96396.9886433106
2        $ 48710.666947391
3       $ 80478.0961525837
4       $ 82089.3454983326
               ...
1374    $ 30173.3803632981
1375    $ 24853.5195136729
1376    $ 13710.6713116427
1377    $ 95426.0144102907
1378    $ 9575.46185684499
Name: earn, Length: 1379, dtype: object

In [150]:
df['earn'] = df['earn'].map(lambda x:'$ ' + str(x))
df

                    earn  height     sex   race  ed  age  race2
0      $ 79571.299011024   73.89    male  white  16   49      0
1     $ 96396.9886433106   66.23  female  white  16   62      0
2      $ 48710.666947391   63.77  female  white  16   33      0
3     $ 80478.0961525837   63.22  female  other  16   95      1
4     $ 82089.3454983326   63.08  female  white  17   43      0
...                  ...     ...     ...    ...  ..  ...    ...
1374  $ 30173.3803632981   71.68    male  white  12   33      0
1375  $ 24853.5195136729   61.31  female  white  18   86      0
1376  $ 13710.6713116427   63.64  female  white  12   37      0
1377  $ 95426.0144102907   71.65    male  white  12   54      0
1378  $ 9575.46185684499   68.22    male  white  12   31      0

[1379 rows x 7 columns]

In [127]:
def f(x):
    race_dict = {'white':0, 'other':1, 'hispanic':2, 'black':3}
    return race_dict[x]

f('white'), f('other'), f('hispanic'), f('black')

(0, 1, 2, 3)

In [128]:
# race 컬럼에 적용 
df['race'].map(f)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [129]:
# 별도 컬럼에 함수 값을  추가
df['race2'] = df['race'].map(f)

In [126]:
# map + 일반함수
# 함수 정의
def f(x):
    race_dict[x] = {'white' : 0 , 'other' : 1, 'hispanic' : 2, 'black' : 3}
    return race_dict[x]

f('white'), f('other'), f('hispanic'), f('black')

NameError: name 'race_dict' is not defined

In [160]:
df.sample(5)

                    earn  height     sex   race  ed  age  race2
915    $ 47648.579482433   70.72    male  white  18   41      0
515   $ 47728.0991250952   69.40    male  black  11   55      3
592   $ 39730.4007784177   73.13    male  white  10   25      0
712   $ 34939.3171908471   61.12    male  white  12   28      0
1355  $ 20065.0827364581   62.98  female  white  16   30      0

### 범주형 데이타의 값 변경

- 데이타프레임.컬럼.map({기존값:새로운값}), 데이타프레임[컬럼].map({기존값:새로운값})
- 데이타프레임.컬럼.replace({기존값:새로운값}), 데이타프레임[컬럼].replace({기존값:새로운값})

In [3]:
df = pd.read_csv("data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [5]:
# 범주형 데이타 => race, sex
df['race'].unique(), df['sex'].unique()

(array(['white', 'other', 'hispanic', 'black'], dtype=object),
 array(['male', 'female'], dtype=object))

In [8]:
# 결측값 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [11]:
# race
# ['white', 'other', 'hispanic', 'black']
# w, o, h, b
# 데이타프레임.컬럼.replace({기존값:새로운값})
df['race2'] = df.race.replace({'white':'w', 'other':'o','hisanic':'h','black':'b'})

In [17]:
df.sample(5)

              earn  height     sex      race  ed  age     race2     race3
1266  12132.502770   65.95  female     white  13   47         w         1
1290   9521.391852   64.41    male  hispanic  10   40  hispanic  hispanic
1180  63629.143685   71.62    male     white  16   37         w         1
529   19100.612680   66.85    male     white  13   71         w         1
15      992.832346   60.06  female     white  12   31         w         1

In [13]:
# race
# ['white', 'other', 'hispanic', 'black']
# w, o, h, b
# 데이타프레임.컬럼.replace({기존값:새로운값})
df['race3'] = df.race.replace({'white':'1', 'other':'2','hisanic':'3','black':'4'})

In [18]:
df.sample(5)

              earn  height     sex   race  ed  age race2 race3
260   13718.454392   64.51  female  other  10   86     o     2
491   64581.952054   57.94  female  black  12   60     b     4
1355  20065.082736   62.98  female  white  16   30     w     1
79    13729.672025   69.96  female  white  13   26     w     1
303   16889.515855   65.01  female  white  14   71     w     1

### height 컬럼 값 변경 

- 인치(in) => 센티미터(cm)
- 1 인치는 2.54 cm
- 참조 : https://search.naver.com/search.naver?where=nexearch&sm=tab_etc&mra=blM0&qvt=0&query=%EA%B8%B8%EC%9D%B4%EB%B3%80%ED%99%98

In [30]:
# 데이타프레임[컬럼명].map(람다함수|함수)

# 함수 정의 (인치 단위 => 센티미터 단위 + (cm))
def change(x):
    return str(round(x*2.54,2)) + '(cm)'

In [31]:
# 함수 호출
change(61.12)

'155.24(cm)'

In [34]:
# map 함수 적용 1
df['height2'] = df['height'].map(change)

In [55]:
df.sample(3)

             earn  height     sex   race  ed  age race2 race3     height2
45    5782.248948   66.49  female  white  15   69     w     1  168.88(cm)
193  32804.654550   64.76  female  white  12   46     w     1  164.49(cm)
720  34400.790169   67.26  female  white  12   49     w     1  170.84(cm)

In [58]:
# map 함수 적용 2 -람다 함수 적용

# 람다함수 테스트
(lambda x:str(round(x*2.54,2)) + '(cm)')(61.12)
# df['height2'] = df['height'].map(change)

'155.24(cm)'

In [61]:
df['height3'] = df['height'].map(lambda x:str(round(x*2.54,2)) + '(cm)')

In [62]:
df

,earn,height,sex,race,ed,age,race2,race3,height2,height3
0,79571.299011,73.89,male,white,16,49,w,1,187.68(cm),187.68(cm)
1,96396.988643,66.23,female,white,16,62,w,1,168.22(cm),168.22(cm)
2,48710.666947,63.77,female,white,16,33,w,1,161.98(cm),161.98(cm)
3,80478.096153,63.22,female,other,16,95,o,2,160.58(cm),160.58(cm)
4,82089.345498,63.08,female,white,17,43,w,1,160.22(cm),160.22(cm)
...,...,...,...,...,...,...,...,...,...,...
1374,30173.380363,71.68,male,white,12,33,w,1,182.07(cm),182.07(cm)
1375,24853.519514,61.31,female,white,18,86,w,1,155.73(cm),155.73(cm)
1376,13710.671312,63.64,female,white,12,37,w,1,161.65(cm),161.65(cm)
1377,95426.014410,71.65,male,white,12,54,w,1,181.99(cm),181.99(cm)
1378,9575.461857,68.22,male,white,12,31,w,1,173.28(cm),173.28(cm)

In [65]:
# apply() 함수 적용 + 람다 
df['height4'] = df['height'].apply(lambda x:str(round(x*2.54 , 2)) + '(cm)')

In [66]:
df.sample(3)

,earn,height,sex,race,ed,age,race2,race3,height2,height3,height4
1340,79603.456464,71.36,male,white,12,54,w,1,181.25(cm),181.25(cm),181.25(cm)
234,55728.589916,66.90,male,white,16,37,w,1,169.93(cm),169.93(cm),169.93(cm)
154,995.465757,66.19,female,black,5,55,b,4,168.12(cm),168.12(cm),168.12(cm)

### 모든 데이타프레임의 컬럼에 동이한 함수 적용
- 데이타프레임.applymap(함수명|람다)

In [67]:
# 수치형 컬럼만 데이타프레임으로 재구성
df2 = df[['earn', 'height','ed', 'age']].copy()
df2

              earn  height  ed  age
0     79571.299011   73.89  16   49
1     96396.988643   66.23  16   62
2     48710.666947   63.77  16   33
3     80478.096153   63.22  16   95
4     82089.345498   63.08  17   43
...            ...     ...  ..  ...
1374  30173.380363   71.68  12   33
1375  24853.519514   61.31  18   86
1376  13710.671312   63.64  12   37
1377  95426.014410   71.65  12   54
1378   9575.461857   68.22  12   31

[1379 rows x 4 columns]

In [69]:
# 모든 컬럼값을 소숫점 1 자리로 변경 

# 람다 구현 
print((lambda x:round(x,1))(9575.461857))

# 함수 구현
def f(x):
    return round(x,1)

f(9575.461857)

9575.5

9575.5

In [71]:
# map 적용
df['earn'].map(lambda x:round(x,1))

0       79571.3
1       96397.0
2       48710.7
3       80478.1
4       82089.3
         ...
1374    30173.4
1375    24853.5
1376    13710.7
1377    95426.0
1378     9575.5
Name: earn, Length: 1379, dtype: float64

In [72]:
# apply 적용
df['earn'].apply(lambda x:round(x,1))

0       79571.3
1       96397.0
2       48710.7
3       80478.1
4       82089.3
         ...
1374    30173.4
1375    24853.5
1376    13710.7
1377    95426.0
1378     9575.5
Name: earn, Length: 1379, dtype: float64

In [84]:
# 모든 컬럼값에 함수 적용
# 데이타프레임.apply(lambda)
df2.applymap(f)

         earn  height  ed  age
0     79571.3    73.9  16   49
1     96397.0    66.2  16   62
2     48710.7    63.8  16   33
3     80478.1    63.2  16   95
4     82089.3    63.1  17   43
...       ...     ...  ..  ...
1374  30173.4    71.7  12   33
1375  24853.5    61.3  18   86
1376  13710.7    63.6  12   37
1377  95426.0    71.7  12   54
1378   9575.5    68.2  12   31

[1379 rows x 4 columns]

In [85]:
df2.applymap(lambda x:round(x,1))

         earn  height  ed  age
0     79571.3    73.9  16   49
1     96397.0    66.2  16   62
2     48710.7    63.8  16   33
3     80478.1    63.2  16   95
4     82089.3    63.1  17   43
...       ...     ...  ..  ...
1374  30173.4    71.7  12   33
1375  24853.5    61.3  18   86
1376  13710.7    63.6  12   37
1377  95426.0    71.7  12   54
1378   9575.5    68.2  12   31

[1379 rows x 4 columns]

In [87]:
# applymap() 적용후 복사본 생성
df3 = df2.applymap(lambda x:round(x,1)).copy()
df3

         earn  height  ed  age
0     79571.3    73.9  16   49
1     96397.0    66.2  16   62
2     48710.7    63.8  16   33
3     80478.1    63.2  16   95
4     82089.3    63.1  17   43
...       ...     ...  ..  ...
1374  30173.4    71.7  12   33
1375  24853.5    61.3  18   86
1376  13710.7    63.6  12   37
1377  95426.0    71.7  12   54
1378   9575.5    68.2  12   31

[1379 rows x 4 columns]

In [93]:
# 데이타프레임 슬라이싱 + applymap() 적용은?
df4 = df[['earn', 'height']].applymap(lambda x:round(x,1)).copy()
df4

         earn  height
0     79571.3    73.9
1     96397.0    66.2
2     48710.7    63.8
3     80478.1    63.2
4     82089.3    63.1
...       ...     ...
1374  30173.4    71.7
1375  24853.5    61.3
1376  13710.7    63.6
1377  95426.0    71.7
1378   9575.5    68.2

[1379 rows x 2 columns]

### 퀴즈
-  1) ratings.dat, users.dat, movies.dat 파일을 하나의 데이타프레임(df)로 공통 컬럼과 공통 키값을 이용하여 조인하여라. 
-  이때 df의 컬럼은 ['userID', 'gender', 'age', 'occupation', 'movieID', 'title', 'genres', 'rating'] 으로 제한한다

In [95]:
df_ratings = pd.read_csv('data/ratings.dat', sep='::', header=None, names=['userID','movieID','rating', 'timestamp'])
df_users = pd.read_csv('data/users.dat', sep='::', names=['userID', 'gender', 'age', 'occupation', 'zip-code'])
df_movies = pd.read_csv('data/movies.dat', sep='::', names=['movieID', 'title', 'genres'])

df_temp = pd.merge(df_users, df_ratings)
df = pd.merge(df_temp, df_movies)
df.columns

Index(['userID', 'gender', 'age', 'occupation', 'zip-code', 'movieID',
       'rating', 'timestamp', 'title', 'genres'],
      dtype='object')

In [101]:
df = df[['userID', 'gender', 'age', 'occupation', 'zip-code', 'movieID','rating', 'timestamp', 'title', 'genres']]
df.sample(3)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres
615750,2917,M,25,0,60201,2605,1,971730216,Entrapment (1999),Crime|Thriller
415133,679,M,35,16,29681,778,3,975607279,Trainspotting (1996),Drama
455401,5570,M,25,1,07666,750,5,959771629,Dr. Strangelove or: How I Learned to Stop Worr...,Sci-Fi|War

In [110]:
### 2) 1의 데이타프레임 df에서 아래의 직업 코드를 참고하여 'occupation' 컬럼값을 변경하여 'job' 컬럼으로 추가하여라 
# 딕셔너리 정의
occ_dict = {0: 'other',
1: 'academic/educator',
2: 'artist',
3: 'clerical/admin',
4: 'college/grad student',
5: 'customer service',
6: 'doctor/health care',
7: 'executive/managerial',
8: 'farmer',
9: 'homemaker',
10: 'K-12 student',
11: 'lawyer',
12: 'programmer',
13: 'retired',
14: 'sales/marketing',
15: 'scientist',
16: 'self-employed',
17: 'technician/engineer',
18: 'tradesman/craftsman',
19: 'unemployed',
20: 'writer'}
# occ_dict

In [109]:
# occupation 컬럼값 확인
np.sort(df['occupation'].unique())

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20], dtype=int64)

In [113]:
# 값을 교체하는 함수로 정의
def change_occ(x):
    # 딕셔너리 정의
    occ_dict = {0: 'other',
                1: 'academic/educator',
                2: 'artist',
                3: 'clerical/admin',
                4: 'college/grad student',
                5: 'customer service',
                6: 'doctor/health care',
                7: 'executive/managerial',
                8: 'farmer',
                9: 'homemaker',
                10: 'K-12 student',
                11: 'lawyer',
                12: 'programmer',
                13: 'retired',
                14: 'sales/marketing',
                15: 'scientist',
                16: 'self-employed',
                17: 'technician/engineer',
                18: 'tradesman/craftsman',
                19: 'unemployed',
                20: 'writer'}
    return occ_dict[x]

In [117]:
# 함수 작동 확인
change_occ(20),change_occ(0)

('writer', 'other')

In [119]:
# 새로운 컬럼 생성 및 함수 적용
df['job'] = df['occupation'].apply(change_occ)

In [122]:
df.sample(5)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job
536829,5448,M,45,19,60626,2529,3,959967267,Planet of the Apes (1968),Action|Sci-Fi,unemployed
933403,3197,F,18,14,94110,1260,5,968636234,M (1931),Crime|Film-Noir|Thriller,sales/marketing
629667,3211,M,50,16,20015,164,4,968545545,Devil in a Blue Dress (1995),Crime|Film-Noir|Mystery|Thriller,self-employed
749944,5501,M,25,2,33334,1212,4,959796559,"Third Man, The (1949)",Mystery|Thriller,artist
904093,3224,F,25,14,93428,3672,3,968519522,Benji (1974),Adventure|Children's,sales/marketing

In [123]:
df.sample(5) [['occupation', 'job']]

        occupation                   job
162056           7  executive/managerial
774978           4  college/grad student
388310          17   technician/engineer
433668           7  executive/managerial
864687          14       sales/marketing

In [126]:
# 3) gender 컬럼 값을 이용하여 M=>0, F=>1로 변경하고 다른 컬럼으로 추가하여라
def change_gen(x):
    # 딕셔너리 정의
    occ_gen = {'M':0,
               'F':1}
    return occ_gen[x]

In [159]:
df['sex'] = df['gender'].apply(change_gen)
# df['gender1'] = df['gender'].map({'M':0, 'F':1})
# df['gender1'] = df['gender'].replace({'M':0, 'F':1})

In [128]:
df

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job,sex
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,K-12 student,1
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama,self-employed,0
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama,programmer,0
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama,executive/managerial,0
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama,academic/educator,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1000204,5949,M,18,17,47901,2198,5,958846401,Modulations (1998),Documentary,technician/engineer,0
1000205,5675,M,35,14,30030,2703,3,976029116,Broken Vessels (1998),Drama,sales/marketing,0
1000206,5780,M,18,17,92886,2845,1,958153068,White Boys (1999),Drama,technician/engineer,0
1000207,5851,F,18,20,55410,3607,5,957756608,One Little Indian (1973),Comedy|Drama|Western,writer,1
1000208,5938,M,25,1,35401,2909,4,957273353,"Five Wives, Three Secretaries and Me (1998)",Documentary,academic/educator,0

In [162]:
# 4) genres 컬럼에서 Adventure 는 모두 몇개인가?
print(len(df[df['genres'].str.contains('Adventure')]),'개')
print(df[df['genres'].str.contains('Adventure')].shape[0],'개')
print(df['genres'].str.contains('Adventure').sum(),'개')

133953 개
133953 개
133953 개

In [ ]:
# 5) 'Adventure' 컬럼을 추가하고 0의 값으로 모두 초기화하여라  
# genres 컬럼값에서 Adventure 가 있다면 'Adventure' 컬럼 값을 1로 변경하여라.

In [149]:
df['genres'].str.contains('Adventure')

0          False
1          False
2          False
3          False
4          False
           ...
1000204    False
1000205    False
1000206    False
1000207    False
1000208    False
Name: genres, Length: 1000209, dtype: bool

In [153]:
def change_ad(x):
    # 딕셔너리 정의
    occ_ad = {False :0,
               True : 1}
    return occ_ad[x]

In [154]:
df['Adventure'] = df['genres'].str.contains('Adventure').apply(change_ad)

In [157]:
df.sample(5)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job,sex,Adventure
730151,5806,F,50,1,08826,1248,5,957985208,Touch of Evil (1958),Crime|Film-Noir|Thriller,academic/educator,1,0
258540,5046,M,25,16,60614,1912,5,962504980,Out of Sight (1998),Action|Crime|Romance,self-employed,0,0
868681,699,M,18,0,73505,1398,3,975564494,In Love and War (1996),Romance|War,other,0,0
552824,4939,M,25,7,63105,208,2,962642980,Waterworld (1995),Action|Adventure,executive/managerial,0,1
887883,150,M,35,7,98144,1280,4,977303316,Raise the Red Lantern (1991),Drama,executive/managerial,0,0

In [158]:
df['Adventure'].value_counts()

0    866256
1    133953
Name: Adventure, dtype: int64

In [163]:
# 불린 마스크 이용 
# 'Adventure' 컬럼을 추가하고 0의 값으로 모두 초기화
df['Adventure'] = 0
df.sample(5)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job,sex,Adventure
932186,4995,M,50,20,55419,417,3,962592619,Barcelona (1994),Comedy|Romance,writer,0,0
358080,2840,M,25,0,60660,42,2,972570656,Dead Presidents (1995),Action|Crime|Drama,other,0,0
802736,846,M,25,5,80209,3726,5,975542983,Assault on Precinct 13 (1976),Action|Thriller,customer service,0,0
169338,5776,M,18,12,97205,780,4,958169196,Independence Day (ID4) (1996),Action|Sci-Fi|War,programmer,0,0
316500,195,M,25,12,10458,353,5,977547733,"Crow, The (1994)",Action|Romance|Thriller,programmer,0,0

In [165]:
df.loc[df['genres'].str.contains('Adventure'), 'Adventure'] = 1

In [166]:
df.sample(5)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job,sex,Adventure
124328,4083,M,56,14,92630,1372,4,965460084,Star Trek VI: The Undiscovered Country (1991),Action|Adventure|Sci-Fi,sales/marketing,0,1
93828,2857,M,25,0,10469,3255,4,972511482,"League of Their Own, A (1992)",Comedy|Drama,other,0,0
189147,2691,M,18,4,06459,1079,4,976387362,"Fish Called Wanda, A (1988)",Comedy,college/grad student,0,0
482695,3401,M,35,7,76109,277,3,980119775,Miracle on 34th Street (1994),Drama,executive/managerial,0,0
534055,5284,M,25,16,55426,541,4,961098613,Blade Runner (1982),Film-Noir|Sci-Fi,self-employed,0,0

In [169]:
# map(), apply() + 람다 이용 

# 람다 테스트 
print((lambda x: 'Adventure' in x)('Action|Adventure|Sci-Fi'))
print((lambda x: 'Adventure' in x)('Sci-Fi'))

True
False

In [170]:
# map(), apply() + 람다 이용 

# 람다 테스트 - 1 또는 0 반환 
print((lambda x: int('Adventure' in x))('Action|Adventure|Sci-Fi'))
print((lambda x: int('Adventure' in x))('Sci-Fi'))

1
0

In [172]:
df['Adventure2'] = df['genres'].apply(lambda x: int('Adventure' in x))

In [182]:
df.sample(10)

,userID,gender,age,occupation,zip-code,movieID,rating,timestamp,title,genres,job,sex,Adventure,Adventure2
93915,3362,F,25,0,90212,3255,3,967672703,"League of Their Own, A (1992)",Comedy|Drama,other,1,0,0
441262,3410,M,35,1,20653,596,5,967420473,Pinocchio (1940),Animation|Children's,academic/educator,0,0,0
588511,2110,M,50,11,46802,3033,4,974652713,Spaceballs (1987),Comedy|Sci-Fi,lawyer,0,0,0
380241,4460,M,25,14,70005,555,4,965073062,True Romance (1993),Action|Crime|Romance,sales/marketing,0,0,0
6596,1866,M,25,7,94043,1197,4,974753173,"Princess Bride, The (1987)",Action|Adventure|Comedy|Romance,executive/managerial,0,1,1
263912,3281,M,25,17,79705,1127,4,968167681,"Abyss, The (1989)",Action|Adventure|Sci-Fi|Thriller,technician/engineer,0,1,1
956523,3031,M,18,4,48135,1053,2,972526871,Normal Life (1996),Crime|Drama,college/grad student,0,0,0
645700,1080,M,56,7,08854,2454,5,974943185,"Fly, The (1958)",Horror|Sci-Fi,executive/managerial,0,0,0
247616,1902,M,25,19,93536,3728,4,975899388,One False Move (1991),Thriller,unemployed,0,0,0
933832,2895,M,25,11,07039,2924,3,972056081,Drunken Master (Zui quan) (1979),Action|Comedy,lawyer,0,0,0

In [173]:
df['genres'].str.contains('Adventure').sum(), df['Adventure'].value_counts()

(133953,
 0    866256
 1    133953
 Name: Adventure, dtype: int64)

In [184]:
df['genres'].str.contains('Adventure').sum(), df['Adventure2'].value_counts()

(133953,
 0    866256
 1    133953
 Name: Adventure2, dtype: int64)

In [ ]:
print